src/Documents/АнкетаОпросник/АнкетаОпросник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АнкетаОпросник</name>
  <attributes>
    <name>СтатусФизическогоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяНалогоплатильщикомИностранногоГосударства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеДвойногоГражданства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаНалогоплаьтильщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаДвойногоГражданства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПДЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>АнкетаОпросник</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значения</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/АнкетаОпросник/АнкетаОпросник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АнкетаОпросник</name>
  <resources>
    <name>СтатусФизическогоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Гражданство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяНалогоплатильщикомИностранногоГосударства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтранаНалогоплатильщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаличиеДвойногоГражданства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтраныДвойногоГражданства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипПДЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтепеньРодства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БенефициарныйВладелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СведенияОВыгодприобретателях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦельУстановленияДеловыхОтношенийСФондом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйХарактер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновныеЦелиФинХоз</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СведенияОТекФинСостоянии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеловаяРепутация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИсточникДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоРаботыРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникДоходаРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументАнкетыОпросника</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/АнкетаОпросник/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ГражданствоПриИзменении(Элемент)
	Если СтрДлина(Объект.Гражданство) <> 7 Тогда
		 Сообщить("Длина не соответствует формату");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Если НЕ АнкетаЗаполнена Тогда
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект),);
		Иначе
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			МассивКлюча = Новый Массив;
			МассивКлюча.Добавить(ПараметрыФормы);
			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.АнкетаОпросник", МассивКлюча);
			СтруктураКлюча = Новый Структура;
			СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи", СтруктураКлюча);
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Перед продолжением нужно записать документ. Продолжить?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Параметры.Ключ.Пустая() Тогда
		ПроверкаАнкеты();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПроверкаАнкеты(ФейкПар1=Неопределено,ФейкПар2=Неопределено) Экспорт
	АнкетаЗаполнена = ПроверкаАнкетыНаСервере();
	Если АнкетаЗаполнена Тогда
		Элементы.ВводАнкеты.Заголовок = "Просмотр и изменение анкеты";
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПроверкаАнкетыНаСервере()
	Если Не Параметры.Ключ.Пустая() Тогда
		РС = РегистрыСведений.АнкетаОпросник.Выбрать(Новый Структура("Документ",Параметры.Ключ));
		Если РС.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции
&НаКлиенте
Процедура ОтветНаВопрос(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
		ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаписатьНаСервере()
	ЭтотОбъект.Записать();	
КонецПроцедуры
